//1) Создайте в программе цикл, который выведет диапазон чисел от 0 до 100 с условием:
//значения выводимые в консоль должны быть кратные 5. 
	// Пример результата:
	// 0
	// 5	
	// 10
	// 15
	// 20
	// …
	// 100

    // for (let i = 0; i <= 100; i++){
    //     if(i % 5 == 0)
    //     console.log(i);
    // }

//------------------------------------------------------
//2) Создайте в программе цикл, который выведет диапазон чисел от 1900 до 2023 с условием: 
// значения выводимые в консоль должны быть отражать значение високосного года по примеру:
//1996, 1992, 1988, 1984, 1980, 1976, 1972, 1968, 1964, 1960, 1956,
//1952, 1948, 1944, 1940, 1936, 1932, 1928, 1924, 1920, 1916, 1912, 1908, 1904

// for(let i = 1900; i<= 2023; i+=4){
//     console.log(i)
// }

//-----------------------------------------------------------------------------------
//3) Создайте в программе цикл, который выведет диапазон чисел от 0 до 100 с условием:
//значения выводимые в консоль должны быть отражать значение простого числа
//Пример результата:
// 2
// 3
// 5
// 7
// 11
// …
// 97

//  for(let i=0; i <= 100; i+=1){
//     if(i % 2 !=0 && i % 3 !=0 && i % 5 !=0 && i % 7 !=0){
//         console.log(i)
//     }
// }

//-------------------------------------------------------------------

//4) В программе задана переменная word со строковым значением. 
//Используя цикл, выведите обратный порядок букв согласно примеру:
//Пример переменной:
//let word = ‘hello’;
//Пример результата:
// o
// l
// l
// e
// h
// let word = 'hello'
//     console.log(word[4]);
//     console.log(word[3]);
//     console.log(word[2]);
//     console.log(word[1]);
//     console.log(word[0]);

//--------------------------------------------------------------------

//5)В программе задана переменная word со строковым значением. 
//Напишите программу, которая перевнет строковое значение согласно примеру:
// Пример переменной:
// let word = ‘hello’;

// Пример результата
// olleh

// let word = "hello";
// for(let i=4; i>=0;i--){
//     console.log(word[i])
// }





