//--------------Массивы как тип данных

//let a = [1,2,3,4,5,6,7,8,9,0]

//a.length - общее количество элементов
// console.log(a[0]);   =1

// console.log(a[3]);   =4

// console.log(a[10]);     = undefined

// a.unshift('ноль') console.log(a);   =добавляет "ноль" в начало строки

// a.pop()  // =удаляет "0"
// a.pop()   //=удаляет "9"
// let b = a.pop()   // =удаляет "8"
// console.log(a);
// console.log(b);    //=добавляет "8" в начало строки(вне массива)

// let b= a.slice(0,8)
// console.log(a,b);  //добавляет массив с элементами из массива от 0 до 8

// let food = ['яблоко', 'ананас', 'виноград', 'клубника', 'груша', 'мандарин']    //смородина абрикос
// food.push ('смородина')
// food.shift()
// food.shift()
// food.pop()
// food.unshift('абрикос')

// console.log(food);
// 1) Добавить в конце "Смородина"
// 2) Удалить Яблоко
// 3) Удалить Ананас
// 4) Удалить последний элемент
// 5) Добавить в начале "Абрикос"

//[ 'абрикос', 'виноград', 'клубника', 'груша', 'мандарин' ]
//---------------------------------------------------------------------------------

//--------------for для массива
//let food = ['яблоко', 'ананас', 'виноград', 'клубника', 'груша', 'мандарин']

// for(let i = 0; i < food.length; i++){
//     console.log(food[i]);
// }

//короткая форма записи цикла (для массива)

// for(let elem of food){
//     elem = elem + ' ' + "tasty"
// console.log(elem);
// }

//----------------------------------------------------------------------------------


//----------------Сравнение массивов
// let a = [1,2,3]
// let b = [1,2,3]
// console.log(a == b);  //false (не может сравнивать массивы)

//----------------------------------------------------------------------------------

// let a = [1,2,3]
// let b = a
// console.log(a == b);  //true (ссылка на массив, поэтому это один массив)

//-----------------------------------------------------------------------------------
//------------------Копия массива
// let a = [1,2,3]
// let b = a.slice()

// a.pop()

// console.log(a);
// console.log(b);
// console.log(a === b);   //[1,2] //[1,2,3] //false
//-----------------------------------------------------------------------------------
//-----------------------------------------------------------------------------------

// let array = [1,2,3,4,5,6,7,8]

// for(let a of array){
//     if(a % 2 == 0){
//         console.log(a);
//     }
// }         //выбрать элементы, которые делятся на 2 без остатка
//------------------------------------------------------------------------------------
// let array = [1,2,3,4,5,6,7,8]

// for(let i in array){
//     array[i] = array[i] **2
// }
//     console.log(array[i])  //выводит квадрат каждого элемента массива

//-------------------------------------------------------------------------------------

 