//----------вывести номер нечётного ключа-------------------
// let obj = {
//     char1: true,
//     char2: 'Windows',
//     char3: 10,
//     char4: 'Car',
//     char5: 54,
//     char6: 'String',
// } 
// for(let elem in obj){
//     if(elem[4] %2 !==0){
//         console.log(elem, obj[elem]);

//   //1)let num = elem.replace('char', '') - подойдёт при неодинаковых значениях
// }
// }
//----------------------------------------------------------------------
//----Задан объект. Измените объект таким образом,
//чтобы в нем не было сво-св, которые содержат булевый тип
// let obj = {
//     char1: true,
//     char2: 'Windows',
//     char3: 10,
//     char4: false,
//     char5: 54,
//     char6: 'String',
// } 
// for(let elem in obj){
//     if(typeof obj[elem] === 'boolean'){
//      delete obj[elem]
//     }
// }
// console.log(obj);

//-----------------------------------------------------------------------
//=======У объектов изначатьно нет никаких методов
//=======Сами методы инициируются в момент создания объекта
//------------------------------------------------------------------------

// Задан объект. Напишите программу, которая проверит,
// есть ли в объекте значение булевого типа. 
// В качестве результата выведите в косноль булевый тип.
// Примечание: цикл использовать нельзя.

// let user = {
//     name: 'Alex',
//     age: 10,
//     isJob: 'tru'
// }
// for(let elem in user){
//     if(typeof user[elem] === 'boolean'){
//         result = true
//         break
//     }
// }
// console.log(result);

//--------------------------------------------------------------------------
let ob1 = {
    name: "al",
    salary: 1000
}

let ob = {
    age: 35,
    isJob: true
}
let result = Object.assign(ob,ob1)
console.log(result, 'result');