// let array = ['One', 'Two', 'Three', 'Four']

// let result = array.find((value,b,c,d) => console.log(value,b,c,d))
//--------------------------------------------------------------------------------
// Найдите элемент массива, 
// у которого имя будет начинаться на N,
// но индекс будет нечентным

// let users = ['Alex', 'Dmitriy', 'Neena', 'Nelli', 'Gendalf']

// let result = users.find((value,index) => value[0] === 'N' && index % 2 !==0)

// console.log(result);
//----------------------------------------------------------------------------

// Отфильтруйте данные таким образом, чтобы
// в новом масиве оказались только числа кратные 1000

// let price = [100,200,1100,2000,5000,20,8000,1000]

// let result = price.filter((value) => value % 1000 === 0)

// console.log(result);
//----------------------------------------------------------------------------

// В качестве решение необхдимо использовать
// цикл for (метод filter использовать нельзя)

// let price = [100,200,1100,2000,5000,20,8000,1000]

// let result = []
// for (let value of price) {
//     if(value % 1000 === 0){
//     result.push(value)    
// }
// }
// console.log(result);

//------------------------------------------------------------------